# Task 1 - Pandas

In [18]:
import pandas as pd
import numpy as np
import pickle

In [2]:
authors_0 = {
    "author_id": [1, 2, 3 ],
    "author_name": ['Тургенев', 'Чехов', 'Островский']
}

authors = pd.DataFrame(authors_0)
authors

   author_id author_name
0          1    Тургенев
1          2       Чехов
2          3  Островский

In [3]:
book_0 = {
    "author_id": [1, 1, 1, 2, 2, 3, 3],
    "book_title": ['Отцы и дети', 'Рудин', 'Дворянское гнездо', 'Толстый и тонкий', 'Дама с собачкой', 'Гроза', 'Таланты и поклонники'],
    "price": [450, 300, 350, 500, 450, 370, 290]
}

books = pd.DataFrame(book_0)

books

   author_id            book_title  price
0          1           Отцы и дети    450
1          1                 Рудин    300
2          1     Дворянское гнездо    350
3          2      Толстый и тонкий    500
4          2       Дама с собачкой    450
5          3                 Гроза    370
6          3  Таланты и поклонники    290

# Task 2

In [4]:
authors_price = pd.merge(authors, books,  on='author_id', how='outer')

In [5]:
authors_price

   author_id author_name            book_title  price
0          1    Тургенев           Отцы и дети    450
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
3          2       Чехов      Толстый и тонкий    500
4          2       Чехов       Дама с собачкой    450
5          3  Островский                 Гроза    370
6          3  Островский  Таланты и поклонники    290

In [6]:
authors_price.sort_values(by="price", inplace=True)
authors_price

   author_id author_name            book_title  price
6          3  Островский  Таланты и поклонники    290
1          1    Тургенев                 Рудин    300
2          1    Тургенев     Дворянское гнездо    350
5          3  Островский                 Гроза    370
0          1    Тургенев           Отцы и дети    450
4          2       Чехов       Дама с собачкой    450
3          2       Чехов      Толстый и тонкий    500

# Task 3

In [7]:
top5 = authors_price.nlargest(5, "price")
top5

   author_id author_name         book_title  price
3          2       Чехов   Толстый и тонкий    500
0          1    Тургенев        Отцы и дети    450
4          2       Чехов    Дама с собачкой    450
5          3  Островский              Гроза    370
2          1    Тургенев  Дворянское гнездо    350

In [8]:
g = authors_price.groupby("author_id")


g["price"].mean()

author_id
1    366.666667
2    475.000000
3    330.000000
Name: price, dtype: float64

In [9]:
g["price"].max()

author_id
1    450
2    500
3    370
Name: price, dtype: int64

In [10]:
g["price"].min()

author_id
1    300
2    450
3    290
Name: price, dtype: int64

In [11]:
g.agg({"price": "max", "price": "min"})

           price
author_id
1            300
2            450
3            290

# Task 4

In [12]:
authors_stat = authors

authors_stat = pd.merge( authors_stat, g["price"].min(), on='author_id', how='outer')
authors_stat = pd.merge( authors_stat, g["price"].max(), on='author_id', how='outer')
authors_stat = pd.merge( authors_stat, g["price"].mean(), on='author_id', how='outer')

authors_stat.columns = ['author_id', 'author_name', 'min_price', 'max_price','mean_price']

authors_stat.drop('author_id', axis=1, inplace=True)

In [13]:
authors_stat

  author_name  min_price  max_price  mean_price
0    Тургенев        300        450  366.666667
1       Чехов        450        500  475.000000
2  Островский        290        370  330.000000

# Task 5

In [14]:
covers = ['твердая', 'мягкая', 'мягкая', 'твердая', 'твердая', 'мягкая', 'мягкая']
authors_cover = authors_price.assign(covers=covers)

In [15]:
authors_cover

   author_id author_name            book_title  price   covers
6          3  Островский  Таланты и поклонники    290  твердая
1          1    Тургенев                 Рудин    300   мягкая
2          1    Тургенев     Дворянское гнездо    350   мягкая
5          3  Островский                 Гроза    370  твердая
0          1    Тургенев           Отцы и дети    450  твердая
4          2       Чехов       Дама с собачкой    450   мягкая
3          2       Чехов      Толстый и тонкий    500   мягкая

In [16]:
soft_hard = pd.pivot_table(authors_cover, values='price', 
                                index='author_name', 
                                columns='covers', 
                                aggfunc=np.sum).fillna(0)

soft_hard

covers       мягкая  твердая
author_name
Островский      0.0    660.0
Тургенев      650.0    450.0
Чехов         950.0      0.0

In [31]:
book_info = soft_hard

In [32]:
with open("book_info.pkl","wb") as f:
    pickle.dump(book_info, f)

In [33]:
book_info2 = []
with open("book_info.pkl","rb") as f:
    book_info2 = pickle.load( f)

In [34]:
book_info2

covers       мягкая  твердая
author_name
Островский      0.0    660.0
Тургенев      650.0    450.0
Чехов         950.0      0.0